package com.pb.titova.hw1;

public class HelloWorld {
    public static void main(String[] args) {
        System.out.println("Hello World");
    }
}


// Создать в пакете hw1 класс HelloWorld с кодом печатающим сообщение "Hello World"